[
  {
    "id": "adda247",
    "name": "Adda247",
    "sector": "Ed-Tech",
    "year-of-investment": [2019],
    "logo": "/assets/investments/adda247_final.png",
    "detailed-image": "",
    "website": "https://adda247.com",
    "linkedin": "https://www.linkedin.com/company/adda247/",
    "description": "Adda 247 is a category leading edtech company serving 30mn+ Indian students aspiring for government jobs. With a brand built over nearly a decade, Adda enjoys tremendous trust in its student base from Tier II and Tier III towns, offering them the convenience of online test preparation, through content across various formats like Live Classes, Video on Demand and Test Series.",
    "latest-news": [
      {
        "title": "Adda247 raises $100 million in Series D funding round led by WestBridge Capital",
        "url": "https://techcrunch.com/2021/11/18/adda247-raises-100-million-in-series-d-funding-round-led-by-westbridge-capital/"
      }
    ]
  },
  {
    "id": "gramophone",
    "name": "Gramophone",
    "sector": "Agri-Tech",
    "year-of-investment": [2019, 2020],
    "logo": "/assets/investments/gramophone_final.png",
    "detailed-image": "",
    "website": "https://gramophone.in/",
    "linkedin": "https://www.linkedin.com/company/gramophone.co.in/",
    "description": "Gramophone is a one-stop solution for all the farming needs right from personalized agronomic intelligence to access to agri-inputs and finally helping farmers with the post-harvest market linkages. With its targeted advisory first sale second approach, not only provides the inputs the farmer requires at his doorstep, but also engages in customized advisory which has the potential to reduce overall input cost, increase yield and potentially increase net- income. Gramophone has so far impacted the lives of ~1.2 million Indian farmers helping them achieve 30% improvement in crop productivity.",
    "latest-news": []
  },
  {
    "id": "truemeds",
    "name": "Truemeds",
    "sector": "Health-Tech",
    "year-of-investment": [2021],
    "logo": "/assets/investments/truemeds_final.png",
    "detailed-image": "",
    "website": "https://www.truemeds.in/",
    "linkedin": "https://www.linkedin.com/company/truemeds-india/",
    "description": "Truemeds is the first of its kind telehealth platform in India focused on recommending best value alternate brand medicines to chronic care patients. Truemeds leverages its intelligent medicine recommendation engine to help patients find the highest quality alternative medicines from the top 1% medicine manufacturers in India and provides free doctor consultations to help patients make the right decisions for themselves.On average, each Truemeds' patient saves ~47% on their monthly medicine bills by using Truemeds' proprietary recommendation engine.",
    "latest-news": []
  },
  {
    "id": "varthana",
    "name": "Varthana",
    "sector": "Ed-Tech",
    "year-of-investment": [2015],
    "logo": "/assets/investments/varthana_final.png",
    "detailed-image": "",
    "website": "https://varthana.com/",
    "linkedin": "https://www.linkedin.com/company/varthana/",
    "description": "Varthana is one of India's leading non-banking financial companies (NBFCs) focused on the education sector. Varthana provides affordable and tailored loans to budget private schools across India, empowering school owners to upgrade infrastructure, improve quality, and expand access to low-cost education. By bridging the financing gap for underserved schools, Varthana supports over 7,000 institutions, impacting the education of more than 3 million students, primarily from low-income families.",
    "latest-news": []
  },
  {
    "id": "greenway",
    "name": "Greenway Appliances",
    "sector": "Climate-Tech",
    "year-of-investment": [2015],
    "logo": "/assets/investments/greenway_final.png",
    "detailed-image": "",
    "website": "https://www.greenwayappliances.com/",
    "linkedin": "https://www.linkedin.com/company/greenway-grameen-infra/",
    "description": "Greenway Appliances offer a viable replacement for the traditional mud chulhas, while also taking cognisance of the health hazards posed by the latter. Greenway's stoves deliver 65% fuel savings and 70% smoke reduction with no noxious fumes, while working on all solid biomass fuels.",
    "latest-news": []
  },
  {
    "id": "saahas",
    "name": "Saahas",
    "sector": "Climate-Tech",
    "year-of-investment": [2017],
    "logo": "/assets/investments/saahas_final.png",
    "detailed-image": "",
    "website": "https://saahaszerowaste.com/",
    "linkedin": "https://www.linkedin.com/company/saahas-zero-waste/",
    "description": "Saahas is a socio-environmental enterprise reclaiming waste as a resource by providing institutions, from small households to large institutions and manufacturers, complete end to end waste solutions. They help each of their clients emerge as zero waste entities by providing a range of services including setting up on-site facilities, providing consulting services, and building decentralized treatment centers. The collected waste is either composted, sorted, sent to the appropriate site or recycled into usable products such as notebooks, gift sets, paper, etc.",
    "latest-news": []
  },
  {
    "id": "janacare",
    "name": "Jana Care",
    "sector": "Health-Tech",
    "year-of-investment": [2019],
    "logo": "/assets/investments/janacare_final.png",
    "detailed-image": "",
    "website": "https://www.janacare.com/",
    "linkedin": "https://www.linkedin.com/company/jana-care/",
    "description": "Jana Care is a global company developing biomarker assays for its proprietary digital health platform with the goal of improving health outcomes for people living with chronic diseases. Our unique approach combines low-cost mobile diagnostics, lifestyle coaching, and predictive analytics, all delivered through a smartphone.",
    "latest-news": []
  },
  {
    "id": "avanti",
    "name": "Avanti",
    "sector": "Ed-Tech",
    "year-of-investment": [2016],
    "logo": "/assets/investments/avanti_final.png",
    "detailed-image": "",
    "website": "www.avanti.in",
    "linkedin": "https://www.linkedin.com/company/avanti-learning-centres/",
    "description": "Avanti has pioneered a blended learning model to provide science and mathematics teaching and JEE coaching at affordable prices across India. Unlike a traditional learning model, in which teachers lecture students for close to 80 percent of their classroom time Avanti, uses a combination of video content and collaborative activities that allows teachers to focus less on lecturing and a lot more on working individually with students in the classroom to teach them problem-solving skills.",
    "latest-news": []
  },
  {
    "id": "ascend",
    "name": "Ascend capital",
    "sector": "Financial Services",
    "year-of-investment": [2024],
    "logo": "/assets/investments/ascend_final.png",
    "detailed-image": "",
    "website": "https://www.ascendcap.in/",
    "linkedin": "https://www.linkedin.com/company/ascendcap/",
    "description": "Ascend Capital is one of India's pioneering non-banking financial companies (NBFCs) focused on bridging the credit gap for underserved micro, small, and medium enterprises (MSMEs). Ascend has formalized access to capital in regions traditionally overlooked by mainstream financial institutions, extending tailored lending solutions to first-generation entrepreneurs and small business owners. Through its inclusive approach, Ascend Capital has supported over 10,000 small enterprises across Tier 2 and Tier 3 cities, creating sustainable livelihoods and enabling local economic growth.",
    "latest-news": []
  },
  {
    "id": "automony",
    "name": "Automony",
    "sector": "Financial Services",
    "year-of-investment": [2020],
    "logo": "/assets/investments/automony_final.png",
    "detailed-image": "",
    "website": "www.automony.in",
    "linkedin": "https://www.linkedin.com/company/automony/",
    "description": "Automony, a commercial vehicle (CV) NBFC. They provide loans to drivers & small/medium transporters to finance pre-owned and new CVs like passenger vehicles, light/small CVs and MUV's and vehicle parts. The CV financing sector is a huge market dominated by the unorganized segment Automony is building a business focused on Tier-II and Tier-III locations, thereby impacting over 50,000 small transporters / truck owners who traditionally take loans at exorbitant rates from informal money lenders.",
    "latest-news": []
  },
  {
    "id": "janaadhar",
    "name": "Janaadhar",
    "sector": "Climate-Tech",
    "year-of-investment": [2014, 2020],
    "logo": "/assets/investments/janaadhar_final.png",
    "detailed-image": "",
    "website": "https://www.janaadhar.com/",
    "linkedin": "https://www.linkedin.com/company/janaadhar/",
    "description": "Janaadhar is India's leading affordable housing developers that offers affordable homes in the price range of Rs. 8 Lakhs – Rs. 15 Lakhs to families belonging to lower income groups. Janaadhar promoted by Jana Urban Foundation and Sterling builders, aims to fulfill the home ownership aspirations of every Indian guided by an uncompromising approach to quality, an emphasis on value for money, and transparency in dealings with all stakeholders. By leveraging the power of technology and building strategic partners with state governments, Janaadhar hopes to realize its vision of building homes that shelter dreams of the economically underserved.",
    "latest-news": []
  },
  {
    "id": "nepra",
    "name": "Nepra",
    "sector": "Climate-Tech",
    "year-of-investment": [2018, 2019],
    "logo": "/assets/investments/nepra_final.png",
    "detailed-image": "",
    "website": "https://www.nepra.co.in/",
    "linkedin": "https://www.linkedin.com/company/let's-recycle---nepra-resource-management-pvt-ltd-/",
    "description": "Nepra Resource Management is one of India's largest waste management solution providers. Nepra has formalized the Indian unregulated and unorganized waste management sector by sourcing waste from the marginalized waste pickers, ensuring long standing relationships by providing fair and transparent prices. Nepra has impacted the lives of 5000+ people from bottom of pyramid and the company processes over 500 tonnes of solid waste per day across Ahmedabad, Indore and Pune.",
    "latest-news": []
  },
  {
    "id": "swarna",
    "name": "Swarna Pragati",
    "sector": "Financial Services",
    "year-of-investment": [2016],
    "logo": "/assets/investments/swarna_final.png",
    "detailed-image": "",
    "website": "https://sphm.co.in/",
    "linkedin": "https://www.linkedin.com/company/swarna-pragati-housing-microfinance-private-limited/",
    "description": "Swarna Pragati Housing Microfinance is the country's first housing finance company to launch a dedicated Housing Microfinance product. They provide loans in the range of Rs.50,000 – Rs.7 Lakhs targeted to economically underserved in rural India based on the principle of incremental housing, where low-income families build their houses one step at a time. With the first loan, families are able to add water and sanitation facilities, and with additional loans, they improve flooring, complete roofing and gradually add new rooms. They have also undertaken financial literacy programmes, income-generating activities, and several research studies to not just provide housing, but productive housing.",
    "latest-news": []
  },
  {
    "id": "vastu",
    "name": "Vastu",
    "sector": "Financial Services",
    "year-of-investment": [2015],
    "logo": "/assets/investments/vastu_final.png",
    "detailed-image": "",
    "website": "https://www.vastuhfc.com/",
    "linkedin": "https://www.linkedin.com/company/vastu-housing-finance-corporation-ltd./",
    "description": "Today Affordable housing finance companies have grown rapidly to build a loan portfolio of Rs. 745 billion, however, if one is self-employed, and without comprehensive documented income or adequate credit history, getting a home loan can prove to be a huge challenge. This is because of traditional lenders, in the current eco-system, find it difficult to 'fit' the average person's case into their income assessment methods. Vastu Housing Finance is a housing finance company that addresses this gap by using a combination of technology and the traditional distribution model to provide simple, easy and flexible loans. Through its unique ability to acquire and underwrite large volumes of such loans, Vastu serves the under-served community.",
    "latest-news": []
  }
]