{
  "mediaData": [
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/2018 W-POWER TRAILBLAZERS - FOR WILMA RODRIGUES TRASH IS TREASURE - March 2018.jpg",
      "heading": "2018 W-POWER TRAILBLAZERS - FOR WILMA RODRIGUES TRASH IS TREASURE - March 2018",
      "summary": "Investors are upbeat about the prospects of the million-dollar (by annual revenues) company. 'Saahas is one of the few enterprises in the Indian waste management space to have a scalable business model,' says Vikram Gandhi, founder, Asha Impact, an impact fund that invested an undisclosed sum in the venture last year. 'The company is on track to achieve profitability.'",
      "link": "https://www.forbesindia.com/2018-wpower-trailblazers/wilma-rodrigues/1691/49"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/2018 W-POWER TRAILBLAZERS - NEHA JUNEJA BIOMASS STOVES ENSURE RURAL INDIA BREATHES EASY - March 2018.jpg",
      "heading": "2018 W-POWER TRAILBLAZERS - NEHA JUNEJA BIOMASS STOVES ENSURE RURAL INDIA BREATHES EASY - March 2018",
      "summary": "Neha Juneja and Ankit Mathur were batchmates at Delhi College of Engineering between 2002 and 2006. After their first venture, Aisapaisa.com, a portal that provided futures and options prices, went bust during the 2008 financial crisis, they began exploring business opportunities in everyday problems. The company has sold about 8 lakh units of its biomass stoves made of steel and aluminum that emit 70 per cent less smoke and consume about 50 per cent less fuel than conventional mud variants across India and South America. The company clocked ₹25 crore in revenue in FY17.",
      "link": "https://www.forbesindia.com/article/2018-wpower-trailblazers/2018-wpower-trailblazers-neha-junejas-biomass-stoves-ensure-rural-india-breathes-easy/49605/1"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/A PAPERLESS GROWTH IN HOUSING FINANCE - March 2017.webp",
      "heading": "A PAPERLESS GROWTH IN HOUSING FINANCE - March 2017",
      "summary": "Vastu Housing Finance is trying to leverage technology to establish and distinguish itself.",
      "link": "https://www.business-standard.com/article/companies/a-paperless-growth-in-housing-finance-117032500829_1.html"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/AAVISHKAAR AND ASHA IMPACT INVEST RS 44 CR IN WASTE MANAGEMENT FIRM NEPRA JUNE 2018.jpg",
      "heading": "AAVISHKAAR AND ASHA IMPACT INVEST RS 44 CR IN WASTE MANAGEMENT FIRM NEPRA JUNE 2018",
      "summary": "With initiatives such as the Swachh Bharat Abhiyan, regulatory push on solid waste management regulations and Extended Producer Responsibility, there is large demand for organised waste management enterprises who can process at scale and provide reliable waste management services.",
      "link": "http://bwdisrupt.businessworld.in/article/Aavishkaar-and-Asha-Impact-Invest-Rs-44-Cr-in-Waste-Management-Firm-Nepra/25-06-2018-152913/"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/AAVISHKAAR AND ASHA IMPACT INVEST RS. 44 CRORE IN NEPRA - June 2018.webp",
      "heading": "AAVISHKAAR AND ASHA IMPACT INVEST RS. 44 CRORE IN NEPRA - June 2018",
      "summary": "Aavishkaar, the impact fund advisory firm and part of the Aavishkaar-Intellecap Group, and Asha Impact, an impact investment and policy advocacy platform for Indian business leaders set up by Vikram Gandhi and Pramod Bhasin, invested Rs. 44 crores as part of the Series-B round of equity investment raised by Nepra Resource Management Private Ltd, an Ahmedabad-based waste aggregation and processing company that operates under the 'Let's Recycle' brand.",
      "link": "https://economictimes.indiatimes.com/small-biz/startups/newsbuzz/aavishkaar-and-asha-impact-invest-rs-44-crore-in-nepra/articleshow/64731876.cms"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/AAVISHKAAR ASHA IMPACT INVEST RS 44 CRORE IN WASTE PROCESSING FIRM NEPRA RESOURCE - June 2018.webp",
      "heading": "AAVISHKAAR ASHA IMPACT INVEST RS 44 CRORE IN WASTE PROCESSING FIRM NEPRA RESOURCE - June 2018",
      "summary": "Ahmedabad-based Nepra to use the funding from Aavishkaar and Asha Impact to expand its operations to 3 more cities and build the foundation for expansion across the country over the next 5 years, says CEO Sandeep Patel.",
      "link": "https://www.livemint.com/Companies/VCSburjGoYuCHyrXICQ8mJ/Aavishkaar-Asha-Impact-invest-Rs44-crore-in-waste-processin.html"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/ACCION VENTURE LAB EXITS VARTHANA - November 2016.png",
      "heading": "ACCION VENTURE LAB EXITS VARTHANA - November 2016",
      "summary": "Accion Venture Lab said Nov. 14 that it sold its stake in Varthana. Bangalore-based Varthana provides specialised loans and support to private schools in India. Varthana raised $14 million in Series B financing in the spring.",
      "link": "https://www.pehub.com/accion-venture-lab-exits-varthana/"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/AFFORDABLE HOUSING - A PLAY OF FINANCE LAND DESIGN AND TECHNOLOGY - January 2017.webp",
      "heading": "AFFORDABLE HOUSING - A PLAY OF FINANCE LAND DESIGN AND TECHNOLOGY - January 2017",
      "summary": "On New Year's Eve, Prime Minister Narendra Modi announced a set of populous measures to boost the real estate sector especially the affordable housing category. But lowering of interest rate is not the only driver in boosting the much-talked affordable housing category, but it equally needs innovation in land allocation and design and technology.",
      "link": "https://www.freepressjournal.in/business/affordable-housing-a-play-of-finance-land-design-and-technology"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/AFFORDABLE HOUSING IS THE FLAVOUR OF THE SEASON - December 2016.webp",
      "heading": "AFFORDABLE HOUSING IS THE FLAVOUR OF THE SEASON - December 2016",
      "summary": "What do Anshu Jain, Jaspal Bindra, Gunit Chadha and Pramod Bhasin have in common? They are all global bankers from India. Right? Yes, they have all been high-profile bankers and now they want to dabble in the affordable housing loans segment.",
      "link": "https://www.livemint.com/Opinion/mcYXQTTz8MWqsk08v4LOAN/Affordable-housing-is-the-flavour-of-the-season.html"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/ARE VCS MISSING OUT ON A HUGE INDIA OPPORTUNITY - February 2014.png",
      "heading": "ARE VCS MISSING OUT ON A HUGE INDIA OPPORTUNITY - February 2014",
      "summary": "Is it possible to thrive financially, while benefiting society? Investors seem to be warming up to this idea, but very slowly.",
      "link": "https://yourstory.com/2017/02/vc-missing-out/amp"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/Ascend Capital raises Rs 50 crore in Series A led by Infoedge, Asha Ventures – Feb 2024.png",
      "heading": "Ascend Capital raises Rs 50 crore in Series A led by Infoedge, Asha Ventures – Feb 2024",
      "summary": "Ascend Capital, a Jaipur-based NBFC focused on EV financing, raised ₹50 crore in a Series A round co-led by InfoEdge Ventures and Asha Ventures. The funding will help the company scale operations, expand its loan book, and upgrade technology. Ascend targets underserved entrepreneurs in Tier 2 and Tier 3 cities, aiming to reach ₹300 crore AUM in two years. The investment aligns with Asha Ventures' focus on inclusive and climate-positive financial solutions.",
      "link": "https://www.autocarpro.in/news/ascend-capital-raises-rs-50-crore-in-series-a-led-by-infoedge-asha-ventures-119183"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/ASHA IMPACT AND ANDE ORGANIZE A WEBINAR ON DEMYSTIFYING MASALA BONDS - September 2019.png",
      "heading": "ASHA IMPACT AND ANDE ORGANIZE A WEBINAR ON DEMYSTIFYING MASALA BONDS - September 2019",
      "summary": "Asha Impact and ANDE hosted their third webinar on blended finance as part of the webinar series 'Demystifying Blended Finance' to bridge the knowledge gap around blended finance instruments. The webinar on Masala Bonds brought together experts from Michael and Susan Dell Foundation, UBS and Deloitte in an engaging conversation to share the suitability of this instrument to scale the impact of small and growing businesses.",
      "link": "https://vimeo.com/360280444/a01591e13b"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/ASHA IMPACT AND SUNDARAM FINANCE INVEST $3 MN IN VEHICLE FINANCING STARTUP AUTOMONY - March 2020.webp",
      "heading": "ASHA IMPACT AND SUNDARAM FINANCE INVEST $3 MN IN VEHICLE FINANCING STARTUP AUTOMONY - March 2020",
      "summary": "Automony, a Mumbai-based NBFC, engaged in providing financing for used and new vehicles has raised $3 Mn in funding from Asha Impact and Sundaram Finance. The company has so far disbursed over 1500 loans across its 15 branches in Maharashtra and Gujarat and plans to expand its AUM from Rs 70 crore to Rs 500 crore in the next two years. Automony aims to fulfil the entrepreneurial ambitions of first-time truck owners and small fleet operators to boost last-mile connectivity.",
      "link": "https://www.vccircle.com/vehicle-financing-startup-automony-raises-series-a-funding"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/ASHA IMPACT, INFOEDGE AND BETTER CAPITAL INVEST 24 CRORE IN AGRI-TECH STARTUP GRAMOPHONE -August 2019.webp",
      "heading": "ASHA IMPACT, INFOEDGE AND BETTER CAPITAL INVEST 24 CRORE IN AGRI-TECH STARTUP GRAMOPHONE - August 2019",
      "summary": "Agriculture tech startup Gramophone has raised 24 crores from impact investors Asha Impact and Better Capital along with existing investor InfoEdge, among others. Gramophone provides actionable agronomic insights coupled with last-mile delivery of quality agriculture inputs to farmers, through a smartphone app and a call centre.",
      "link": "https://www.livemint.com/companies/start-ups/agri-tech-startup-gramophone-raises-rs-24-crore-from-infoedge-others-1565151577158.html"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/ASHA IMPACT, INFOEDGE AND STERLITE TECHNOLOGIES INVEST $6 MN IN EDTECH STARTUP ADDA247 - November 2019.jpg",
      "heading": "ASHA IMPACT, INFOEDGE AND STERLITE TECHNOLOGIES INVEST $6 MN IN EDTECH STARTUP ADDA247 - November 2019",
      "summary": "Adda247, a Delhi-based edtech startup that provides online coaching for government job entrance tests raised $6 Mn in Series B funding led by Infoedge India Ltd and Asha Impact. Sterlite Ventures, which is an existing investor of Adda247 also participated in the latest round. With more than 40 million users on the platform and more than 3 million Daily Active Users (DAU), it is the most used online education platform in India. The edtech startup plans to leverage this funding for expanding to new exam categories, adding new vernacular languages on the platform and amplifying its pan-India presence.",
      "link": "https://inc42.com/buzz/with-6-mn-funding-edtech-startup-adda247-plans-to-go-vernacular/"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/AVANTI LEARNING CENTRES RAISES 5M FROM MSDF AND OTHERS - VC Circle - February 2016.webp",
      "heading": "AVANTI LEARNING CENTRES RAISES 5M FROM MSDF AND OTHERS - VC Circle - February 2016",
      "summary": "Michael & Susan Dell Foundation (MSDF) has led a Rs 33.1 crore (around $5 million) round of funding in Delhi-based test prep startup Avanti Learning Centres. Avanti will use the funds to expand its centres and to develop its curriculum and technology.",
      "link": "https://www.vccircle.com/avanti-learning-centres-raises-5m-msdf-others"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/AVANTI SHOWS A DIFFERENT WAY OF TEACHING - June 2016.png",
      "heading": "AVANTI SHOWS A DIFFERENT WAY OF TEACHING - June 2016",
      "summary": "Sarfaraz Iraque is among the hundreds of thousands of students who aspire to clear the country's coveted entrance exams to enter the elite Indian Institutes of Technology. The 18-year-old is not among the thousands who made it through.",
      "link": "https://www.business-standard.com/article/companies/avanti-shows-a-different-way-of-teaching-116062500853_1.html"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/BANKING ON SOCIAL IMPACT - February 2017.png",
      "heading": "BANKING ON SOCIAL IMPACT - February 2017",
      "summary": "At the age of 9 or 10, when most children were busy playing cricket or football on weekends, Vikram Gandhi taught English to 5- to -6-year-olds at an orphanage at Byculla in Mumbai called Asha Daan. It was during those days that the concept of community service got embedded in his impressionable mind.",
      "link": "https://www.business-standard.com/article/specials/banking-on-social-impact-117020301322_1.html"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/BIOMASS STOVE MAKER GREENWAY RAISES 2.5M FROM PRAMOD BHASIN AND OTHERS - February 2016.webp",
      "heading": "BIOMASS STOVE MAKER GREENWAY RAISES 2.5M FROM PRAMOD BHASIN AND OTHERS - February 2016",
      "summary": "Mumbai-based biomass cooking stove maker Greenway Appliances has secured $2.5 million as part of a Series A round of funding from former Genpact CEO Pramod Bhasin and others, according to a report by The Economic Times.",
      "link": "https://www.vccircle.com/biomass-stove-maker-greenway-raises-25m-pramod-bhasin-others"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/BLOCKBUSTER EXIT FOR ASHA IMPACT FROM NBFC VARTHANA - May 2018.webp",
      "heading": "BLOCKBUSTER EXIT FOR ASHA IMPACT FROM NBFC VARTHANA - May 2018",
      "summary": "Impact investment and policy advocacy platform Asha Impact has exited its stake in Bengaluru-based NBFC Varthana, clocking steady returns on the investment made less than three years ago. The sale of its minority stake in Varthana to private equity firm ChrysCapital Advisors and some of the other existing investors has fetched Asha Impact a return of over five times on its investment of Rs 4 crore made in 2015, thus accruing it well over Rs 20 crore, according to people familiar with the deal.",
      "link": "https://economictimes.indiatimes.com/small-biz/startups/newsbuzz/blockbuster-exit-for-asha-impact-from-nbfc-varthana/articleshow/64161364.cms"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/CLEANER HEALTHIER COOKSTOVES MAY AT LONG LAST BE CATCHING ON - October 2016.jpg",
      "heading": "CLEANER HEALTHIER COOKSTOVES MAY AT LONG LAST BE CATCHING ON - October 2016",
      "summary": "For about 3 billion of the world's poorest people, the simple act of cooking dinner is fraught with risk. They burn wood, charcoal, dung or crop waste, often on open fires, fouling the air they breathe.",
      "link": "https://ensia.com/features/cleaner-cookstoves/"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/Decoding Asha Ventures' $100 Mn Playbook For Impact Investing – Dec 2023.jpg",
      "heading": "Decoding Asha Ventures' $100 Mn Playbook For Impact Investing – Dec 2023",
      "summary": "The maiden fund, Asha Ventures Fund I, aims for a $100 million corpus, with a first close at $50 million in December 2023. The fund targets investments between $2 million and $10 million in sectors such as sustainability, healthcare, and inclusion. The firm has already invested in companies like Ascend Capital, Truemeds, and AutoMony, with plans to make 10–12 more investments over the next three to four years.",
      "link": "https://inc42.com/features/decoding-asha-ventures-100-mn-playbook-for-impact-investing/"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/Driving impact through scalable, inclusive innovation – Feb 2025.png",
      "heading": "Driving impact through scalable, inclusive innovation – Feb 2025",
      "summary": "Amit Mehta, Managing Partner at Asha Ventures, transitioned from investment banking and private equity to co-found the impact-focused firm in 2014. Asha Ventures targets early-to-growth-stage startups in sustainability, healthcare, and inclusion, focusing on India's emerging middle class. Their $100 million fund supports scalable businesses that deliver financial returns and societal benefits. The firm has invested in companies like Ascend Capital and plans 10–12 more investments soon. Amit's vision centres on using finance to drive positive social change.",
      "link": "https://www.founderthesis.com/p/amit-mehtas-asha-ventures-path-to"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/EXCLUSIVE PRAMOD BHASIN VIKRAM GANDHI AND OTHERS INVEST IN SWARNA PRAGATI - October 2016.webp",
      "heading": "EXCLUSIVE PRAMOD BHASIN VIKRAM GANDHI AND OTHERS INVEST IN SWARNA PRAGATI - October 2016",
      "summary": "Chennai-based housing finance company Swarna Pragati Housing Microfinance Pvt. Ltd has raised an undisclosed amount from a group of investors including Zephyr Peacock, Omidyar Network, Aavishkar Goodwill in a Series B round, a top company executive told VCCircle.",
      "link": "https://www.youthkiawaaz.com/2017/02/nit-trichy-youth-summit/"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/FINALLY AN INCLUSIVE MORTGAGE MARKET - August 2016.webp",
      "heading": "FINALLY AN INCLUSIVE MORTGAGE MARKET - August 2016",
      "summary": "India's roughly Rs.10 trillion mortgage market is witnessing a quiet revolution. Even though it has been growing at around 18-19 % every year, the size of the market continues to be pretty small—a minuscule portion of India's GDP—but the interesting development is that around one-third of the new home loans, in terms of units, has started flowing into the low-cost housing segment, where the size of a loan is less than ₹10 lakh.",
      "link": "https://www.livemint.com/Opinion/fRYayJUap7vpZsPv5788nN/Finally-an-inclusive-mortgage-market.html"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/FUTURE GENERALI INDIA LIFE INSURANCE PARTNERS WITH VASTU HOUSING FINANCE CORPORATION - January 2017.png",
      "heading": "FUTURE GENERALI INDIA LIFE INSURANCE PARTNERS WITH VASTU HOUSING FINANCE CORPORATION - January 2017",
      "summary": "Future Generali India Life Insurance has recently added a new partner to further grow its Credit Life business. The Company has entered into an agreement with Vastu Housing Finance Corporation Ltd. to offer group credit life insurance through one of its products – Future Generali Loan Suraksha Plan.",
      "link": "https://www.indiainfoline.com/"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/GETTING TO THE HEART OF IMPACT INVESTMENT IN INDIA - March 2016.png",
      "heading": "GETTING TO THE HEART OF IMPACT INVESTMENT IN INDIA - March 2016",
      "summary": "More and more people are becoming familiar with the related concepts of impact investing and social entrepreneurship. These ideas are commanding increasing attention in business, academia and government, and also among the public at large, with hundreds of articles and dozens of research studies.",
      "link": "https://www.huffpost.com/news/topic/india/kartik-desai/getting-to-the-heart-of-i_b_9345524.html"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/GREENWAY GRAMEEN COOKING WITHOUT SMOKE - October 2016.webp",
      "heading": "GREENWAY GRAMEEN COOKING WITHOUT SMOKE - October 2016",
      "summary": "In more ways than one, 31-year-old Neha Juneja stands out. The co-founder and CEO of Greenway Grameen is intelligent, unassuming and sensitive, something one rarely finds in one single person.",
      "link": "https://www.business-standard.com/article/companies/greenway-grameen-cooking-without-smoke-116101600765_1.html"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/HOW GREENWAY GRAMEEN INFRA BECAME INDIAS LARGEST PRODUCER OF COOK STOVES - March 2016.jpg",
      "heading": "HOW GREENWAY GRAMEEN INFRA BECAME INDIAS LARGEST PRODUCER OF COOK STOVES - March 2016",
      "summary": "Between 2011 and 2012, when Neha Juneja and Ankit Mathur, co-founders of Greenway Grameen Infra's Smart Stove, were trying to sell their product in the market and to investors, they were met with a lot of scepticism. Neha recalls …",
      "link": "https://www.youthkiawaaz.com/2017/02/nit-trichy-youth-summit/"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/HOW ONE MAN IS CHANGING THE FACE OF HOUSING IN RURAL INDIA - December 2016.jpg",
      "heading": "HOW ONE MAN IS CHANGING THE FACE OF HOUSING IN RURAL INDIA - December 2016",
      "summary": "Historians will tell you that an explosion of creativity occurs the moment the world starts complaining that there is nothing left to invent or that the search for solutions to complex problems has come to an end.",
      "link": "https://www.dailyo.in/politics/panchayat-rural-india-swarna-pragati-schemes-microfinance-land-rights-india/story/1/14737.html"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/HOW PRAMOD BHASIN AND VIKRAM GANDHI MINTED MONEY IN ASHA IMPACT VARTHANA EXIT - May 2018.webp",
      "heading": "HOW PRAMOD BHASIN AND VIKRAM GANDHI MINTED MONEY IN ASHA IMPACT VARTHANA EXIT - May 2018",
      "summary": "Investment banker Vikram Gandhi and former chief executive officer of IT services major Genpact, Pramod Bhasin, struck a multi-bagger exit from Bengaluru-based school finance company Thirumeni Finance Pvt. Ltd, which operates under the Varthana brand.",
      "link": "https://www.vccircle.com/how-pramod-bhasin-and-vikram-gandhi-minted-money-in-asha-impacts-varthana-exit"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/HOW SOCIAL-IMPACT INVESTMENTS SHAPED UP IN INDIA LAST YEAR.webp",
      "heading": "HOW SOCIAL-IMPACT INVESTMENTS SHAPED UP IN INDIA LAST YEAR",
      "summary": "Media coverage of the recently launched IIC-Asha Impact Report, 'The India Impact Investing Story (2010-2019): Capital plus Innovation for Impact' launched as part of the Indian Impact Investing Showcase organised on 30th June 2020. The report is the first comprehensive study on capital flows, business models, and aggregate impact created by the Indian impact investment industry over the last decade.",
      "link": "https://www.vccircle.com/how-social-impact-investments-shaped-up-in-india-last-year"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/IMPACT INVESTING TOUCHES $11B; HELPS 490 MILLION LIVES IN 10 YEARS.webp",
      "heading": "IMPACT INVESTING TOUCHES $11B; HELPS 490 MILLION LIVES IN 10 YEARS",
      "summary": "Media coverage of the recently launched IIC-Asha Impact Report, 'The India Impact Investing Story (2010-2019): Capital plus Innovation for Impact' launched as part of the Indian Impact Investing Showcase organised on 30th June, 2020. The report is the first comprehensive study on capital flows, business models, and aggregate impact created by the Indian impact investment industry over the last decade.",
      "link": "https://yourstory.com/2020/07/impact-investing-touches-11bn-helps-490-million-lives/amp"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/IMPACT INVESTMENT FIRM ASHA IMPACT EXITS VARTHANA WITH 5X RETURNS IN 3 YRS - May 2018.jpg",
      "heading": "IMPACT INVESTMENT FIRM ASHA IMPACT EXITS VARTHANA WITH 5X RETURNS IN 3 YRS - May 2018",
      "summary": "Impact investment and policy advocacy platform Asha Impact has exited its stake in Bengaluru-based NBFC Varthana, clocking steady returns on the investment made less than three years ago.",
      "link": "https://economictimes.indiatimes.com/startups/impact-investment-firm-asha-impact-exits-varthana-with-5x-returns-in-3-yrs/articleshow/64162116.cms"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/Impact investor Asha Ventures raises $10 million from British International Investment – April 2025.webp",
      "heading": "Impact investor Asha Ventures raises $10 million from British International Investment – April 2025",
      "summary": "Asha Ventures has secured $10 million in funding from British International Investment (BII), the UK's development finance institution. The capital will be used to support Asha's mission of backing impact-driven startups in areas like financial inclusion, climate solutions, and education. The investment highlights growing global interest in India's social enterprise ecosystem.",
      "link": "https://economictimes.indiatimes.com/tech/funding/impact-investor-asha-ventures-raises-10-million-from-british-international-investment/articleshow/120043747.cms?from=mdr"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/IMPACT START UPS QUEST FOR FUNDS - February 2016.webp",
      "heading": "IMPACT START UPS QUEST FOR FUNDS - February 2016",
      "summary": "Aasaanjobs' fund-raising journey has been a bit different so far from most impact start-ups. Last January, the Mumbai-based company picked up $1.5 million in seed capital from Inventus Capital Partners and IDG Ventures India. Both are mainstream venture capital firms and generally don't back businesses that focus on consumers at the bottom half of the pyramid.",
      "link": "https://www.livemint.com/Opinion/NCW4QHOzxlvJWMpUZ6w20I/Impact-startups-quest-for-funds.html"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/INDIAN HOUSING LOAN COMPANY WINS FINANCIAL INCLUSION CHALLENGE 2016 - June 2016.png",
      "heading": "INDIAN HOUSING LOAN COMPANY WINS FINANCIAL INCLUSION CHALLENGE 2016 - June 2016",
      "summary": "Swarna Pragati Housing Microfinance Co., an Indian company providing housing loans to the poor, won The Wall Street Journal's competition on achievements in financial inclusion.",
      "link": "https://www.wsj.com/articles/indian-housing-loan-company-wins-financial-inclusion-challenge-2016-1464868093"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/INDIAN IMPACT INVESTING COMES OF AGE, RAISES $11 B IN CAPITAL, TOUCHES 490 MILLION LIVES.png",
      "heading": "INDIAN IMPACT INVESTING COMES OF AGE, RAISES $11 B IN CAPITAL, TOUCHES 490 MILLION LIVES",
      "summary": "Media coverage of the recently launched IIC-Asha Impact Report, 'The India Impact Investing Story (2010-2019): Capital plus Innovation for Impact' launched as part of the Indian Impact Investing Showcase organised on 30th June 2020. The report is the first comprehensive study on capital flows, business models, and aggregate impact created by the Indian impact investment industry over the last decade.",
      "link": "http://bwdisrupt.businessworld.in/article/Indian-Impact-Investing-Comes-Of-Age-Raises-11-B-In-Capital-Touches-490-Million-Lives/13-07-2020-296867/"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/MEET SOME OF INDIAS HNIS WHO ARE CREATING A SOCIAL IMPACT AND ENJOYING FINANCIAL RETURNS - January 2017.jpg",
      "heading": "MEET SOME OF INDIAS HNIS WHO ARE CREATING A SOCIAL IMPACT AND ENJOYING FINANCIAL RETURNS - January 2017",
      "summary": "According to the Impact Investors Council, the biggest gap in impact investing in India is the lack of funding from domestic investors. The Council estimates that 80-85 percent of impact investments come from overseas.",
      "link": "https://www.forbesindia.com/article/social-impact-special/meet-some-of-indias-hnis-who-are-creating-a-social-impact-and-enjoying-financial-returns/45329/1"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/MULTIPLES ALTERNATIVES FORMER SENIOR BANKERS TO INVEST OVER RS 100 CRORE IN MUMBAI BASED VASTU HOUSING - Economic Times - December 2015.webp",
      "heading": "MULTIPLES ALTERNATIVES FORMER SENIOR BANKERS TO INVEST OVER RS 100 CRORE IN MUMBAI BASED VASTU HOUSING - Economic Times - December 2015",
      "summary": "Local private equity fund Multiples Alternatives, along with a clutch of former senior bankers, will invest over Rs 100 crore in Mumbai-based housing finance firm Vastu Housing Finance Corp to own 95% stake in the start-up firm relaunched by senior bankers.",
      "link": "https://economictimes.indiatimes.com/industry/banking/finance/multiples-alternatives-former-senior-bankers-to-invest-over-rs-100-crore-in-mumbai-based-vastu-housing/articleshow/50360417.cms"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/MUMBAI BASED AVANTI LEARNING CENTRES RAISES RS 33 CR FUNDING FROM MICHAEL AND SUSAN DELL FOUNDATION - February 2016.webp",
      "heading": "MUMBAI BASED AVANTI LEARNING CENTRES RAISES RS 33 CR FUNDING FROM MICHAEL AND SUSAN DELL FOUNDATION - February 2016",
      "summary": "Asha Impact and MSDF co-lead the funding for Avanti's expansion.",
      "link": "https://yourstory.com/2016/02/avanti-learning-centres-funding-michael-susan-dell-foundation/amp"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/NDTV PRIME LAUNCHES THE REAL DEAL SHOW ON SOCIAL ENTREPRENEURSHIP - March 2016.webp",
      "heading": "NDTV PRIME LAUNCHES THE REAL DEAL SHOW ON SOCIAL ENTREPRENEURSHIP - March 2016",
      "summary": "NDTV Prime has launched 'The Real Deal', a television show and 360 degree media property on impact investing and social entrepreneurship. The show will premiere on March 24, 2016 and will be aired every Friday at 9 pm, March 25 onwards. From waste managers, skills development, financial and meal visionaries to farmers and healthcare managers, the contestants will fight it out in a set of innovative challenges that will test skills required to be a social entrepreneur.",
      "link": "https://www.exchange4media.com/industry-briefing-news/ndtv-prime-launches-'the-real-deal'-show-on-social-entrepreneurship-63767.html"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/Post budget quote from Amit Mehta, Managing Partner, Asha Ventures – Feb 2025.jpg",
      "heading": "Post budget quote from Amit Mehta, Managing Partner, Asha Ventures – Feb 2025",
      "summary": "Amit Mehta, Managing Partner at Asha Ventures, expressed strong support for the Union Budget's emphasis on inclusive and sustainable growth. He highlighted the government's focus on key sectors such as agriculture, youth, women, and farmers, noting that these initiatives reflect a commitment to broad-based development. Mehta also welcomed the establishment of a Deep Tech Fund of Funds, which aims to foster innovation in areas like AI, robotics, and advanced manufacturing.",
      "link": "https://www.apnnews.com/post-budget-quote-from-amit-mehta-managing-partner-asha-ventures/"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/SEED FUNDING ENTERPRISES IS WHERE OUR HEART IS - March 2017.png",
      "heading": "SEED FUNDING ENTERPRISES IS WHERE OUR HEART IS - March 2017",
      "summary": "'We will continue to do more of the same, which is very early-stage or seed-stage investing in businesses that are serving the masses or are serving large numbers of low-income population,' says Srikrishna Ramamoorthy, Partner, Unitus Seed Fund, a seed-stage venture fund based in Bengaluru.",
      "link": "https://www.thehindubusinessline.com/specials/emerging-entrepreneurs/seedfunding-enterprises-is-where-our-heart-is/article9572470.ece"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/THIS KANPUR LAD IS RAISING MONEY TO FUND HIS STUDIES AT MIT - February 2016.webp",
      "heading": "THIS KANPUR LAD IS RAISING MONEY TO FUND HIS STUDIES AT MIT - February 2016",
      "summary": "The Alchemist by Paulo Coelho is Ayush Sharma's favourite book. 'It reminds me of one of the most important lessons in my life, that I should always pursue my goals and destiny, and engage in the quest of greater purpose and fulfilment,' he shares.",
      "link": "https://www.dnaindia.com/lifestyle/report-this-kanpur-lad-is-raising-money-to-fund-his-studies-at-mit-2181832"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/Truemeds to raise $44 Mn led by Accel India – March 2025.webp",
      "heading": "Truemeds to raise $44 Mn led by Accel India – March 2025",
      "summary": "Mumbai-based healthtech startup Truemeds has raised $44 million in a funding round led by Accel India, with participation from existing backers like InfoEdge Ventures and Asha Ventures. The company, known for delivering cost-effective generic medicines, aims to use the funds to enhance its supply chain, boost tech capabilities, and expand nationwide. The funding reflects growing investor confidence in the affordable healthcare segment.",
      "link": "https://entrackr.com/exclusive/exclusive-truemeds-to-raise-44-mn-led-by-accel-india-8823054"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/UNITUS SEED FUND IS CLEARING THE DECKS FOR A SECOND FUND TO SUPPORT NEW AGE SOCIAL VENTURES - January 2017.jpg",
      "heading": "UNITUS SEED FUND IS CLEARING THE DECKS FOR A SECOND FUND TO SUPPORT NEW AGE SOCIAL VENTURES - January 2017",
      "summary": "In early 2015, when Unitus Seed Fund announced it would invest in Bengaluru-based startup BetterPlace Safety Solutions, it was another indication that the fund, an impact investment pioneer in India, was ready to ramp up its footprint in the country.",
      "link": "https://www.forbesindia.com/article/social-impact-special/unitus-seed-fund-is-clearing-the-decks-for-a-second-fund-to-support-newage-social-ventures/45407/1"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/VARTHANA BAGS RS 93 CRORE IN SERIES B FUNDING - Economic Times - April 2016.jpg",
      "heading": "VARTHANA BAGS RS 93 CRORE IN SERIES B FUNDING - Economic Times - April 2016",
      "summary": "Varthana, a non-banking finance company (NBFC) that provides debt financing and solutions to private schools that enrol students from low-income families, has secured ₹93 crore ($14 million) in Series-B funds from a clutch of investors led by Kaizen Private Equity and Zephyr Peacock India.",
      "link": "https://economictimes.indiatimes.com/small-biz/startups/varthana-bags-rs-93-crore-in-series-b-funding/articleshow/51818352.cms"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/VARTHANA EYES SIM MORE TO TOP UP SERIES B FUNDING ROUND - April 2016.webp",
      "heading": "VARTHANA EYES SIM MORE TO TOP UP SERIES B FUNDING ROUND - April 2016",
      "summary": "Bengaluru-based non-banking finance company (NBFC) Thirumeni Finance Pvt Ltd that operates under the banner of Varthana and lends to affordable private schools, has raised ₹93 crore ($14 million) in its Series B round of financing led by Kaizen Private Equity and Zephyr Peacock India, as per a company statement.",
      "link": "https://www.vccircle.com/varthana-eyes-1m-more-top-series-b-funding-round"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/VARTHANA RAISES 53 MILLION FROM DELL FOUNDATION TO EXPAND ITS SCHOOL TRANSFORMATION PROGRAM - October 2017.jpg",
      "heading": "VARTHANA RAISES $3 MILLION FROM DELL FOUNDATION TO EXPAND ITS SCHOOL TRANSFORMATION PROGRAM - October 2017",
      "summary": "Bengaluru-based school finance company Varthana has raised $3 million in funding from the Michael and Susan Dell Foundation to expand its school transformation program (STP). The programme is aimed at improving the quality of learning in private schools by extending credit facilities.",
      "link": "https://www.livemint.com/Companies/zPtlhpIZ9UPapAOvHwJFJM/Varthana-raises-3-million-for-its-school-financing-program.html"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/VARTHANA RAISES RS 350 CRORE FROM CHRYSCAPITAL ADVISORS AND OTHERS - April 2018.webp",
      "heading": "VARTHANA RAISES RS 350 CRORE FROM CHRYSCAPITAL ADVISORS AND OTHERS - April 2018",
      "summary": "ChrysCapital Advisors Llp, the largest home-grown private equity (PE) fund, has acquired a significant minority stake in Thirumeni Finance Pvt. Ltd, a Bengaluru-based non-banking financial company (NBFC) that operates under the name Varthana, according to senior executive.",
      "link": "https://www.livemint.com/Companies/tha30GIYYK2Wb6Z1RhBEmN/Varthana-raises-Rs350-crore-from-ChrysCapital-others.html"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/WASTE MANAGEMENT FIRM NEPRA RAISES SERIES B FUNDING FROM AAVISHKAAR, ASHA IMPACT -June 2018.webp",
      "heading": "WASTE MANAGEMENT FIRM NEPRA RAISES SERIES B FUNDING FROM AAVISHKAAR, ASHA IMPACT -June 2018",
      "summary": "Nepra Resource Management Pvt. Ltd, a waste management company that operates under the 'Let's Recycle' brand, has raised Rs 44 crore ($6.5 million) in its Series B round of funding. The funds were raised from existing impact investor Aavishkaar and new impact investor Asha Impact, Nepra said in a statement.",
      "link": "https://www.vccircle.com/waste-management-firm-nepra-raises-series-b-funding-from-aavishkaar-asha-impact"
    },
    {
      "image": "/assets/images of media- knowledge resources- asha ventures/WHERE ARE INDIAN INCUBATORS AND ACCELERATORS LACKING - VCS SHARE THEIR THOUGHTS AT INCUBATOR CONNECT - March 2017.png",
      "heading": "WHERE ARE INDIAN INCUBATORS AND ACCELERATORS LACKING - VCS SHARE THEIR THOUGHTS AT INCUBATOR CONNECT - March 2017",
      "summary": "Names like Airbnb, Dropbox, Zenefits, Instacart, and Reddit are among the billion-dollar companies that were incubated by Y Combinator at an early stage. Since 2005, Y Combinator, a California-based seed accelerator, has funded over 1,400 startups, which today have a combined valuation of over $80 billion.",
      "link": "https://yourstory.com/2017/03/incubator-connect-vcs/amp"
    }
  ]
}
